ARMmbed/mbed-os/targets/TARGET_Atmel/TARGET_SAM_CortexM0P/utils/cmsis/TARGET_SAML21/include/component/comp_evsys.h
/**
 * \file
 *
 * \brief Component description for EVSYS
 *
 * Copyright (c) 2014-2015 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="http://www.atmel.com/design-support/">Atmel Support</a>
 */

#ifndef _SAML21_EVSYS_COMPONENT_
#define _SAML21_EVSYS_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR EVSYS */
/* ========================================================================== */
/** \addtogroup SAML21_EVSYS Event System Interface */
/*@{*/

#define EVSYS_U2256
#define REV_EVSYS                   0x100

/* -------- EVSYS_CTRLA : (EVSYS Offset: 0x00) (R/W  8) Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint8_t  SWRST: 1;         /*!< bit:      0  Software Reset                     */
        uint8_t  : 7;              /*!< bit:  1.. 7  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    uint8_t reg;                 /*!< Type      used for register access              */
} EVSYS_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_CTRLA_OFFSET          0x00         /**< \brief (EVSYS_CTRLA offset) Control */
#define EVSYS_CTRLA_RESETVALUE      0x00ul       /**< \brief (EVSYS_CTRLA reset_value) Control */

#define EVSYS_CTRLA_SWRST_Pos       0            /**< \brief (EVSYS_CTRLA) Software Reset */
#define EVSYS_CTRLA_SWRST           (0x1ul << EVSYS_CTRLA_SWRST_Pos)
#define EVSYS_CTRLA_MASK            0x01ul       /**< \brief (EVSYS_CTRLA) MASK Register */

/* -------- EVSYS_CHSTATUS : (EVSYS Offset: 0x0C) (R/  32) Channel Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t USRRDY0: 1;       /*!< bit:      0  Channel 0 User Ready               */
        uint32_t USRRDY1: 1;       /*!< bit:      1  Channel 1 User Ready               */
        uint32_t USRRDY2: 1;       /*!< bit:      2  Channel 2 User Ready               */
        uint32_t USRRDY3: 1;       /*!< bit:      3  Channel 3 User Ready               */
        uint32_t USRRDY4: 1;       /*!< bit:      4  Channel 4 User Ready               */
        uint32_t USRRDY5: 1;       /*!< bit:      5  Channel 5 User Ready               */
        uint32_t USRRDY6: 1;       /*!< bit:      6  Channel 6 User Ready               */
        uint32_t USRRDY7: 1;       /*!< bit:      7  Channel 7 User Ready               */
        uint32_t USRRDY8: 1;       /*!< bit:      8  Channel 8 User Ready               */
        uint32_t USRRDY9: 1;       /*!< bit:      9  Channel 9 User Ready               */
        uint32_t USRRDY10: 1;      /*!< bit:     10  Channel 10 User Ready              */
        uint32_t USRRDY11: 1;      /*!< bit:     11  Channel 11 User Ready              */
        uint32_t : 4;              /*!< bit: 12..15  Reserved                           */
        uint32_t CHBUSY0: 1;       /*!< bit:     16  Channel 0 Busy                     */
        uint32_t CHBUSY1: 1;       /*!< bit:     17  Channel 1 Busy                     */
        uint32_t CHBUSY2: 1;       /*!< bit:     18  Channel 2 Busy                     */
        uint32_t CHBUSY3: 1;       /*!< bit:     19  Channel 3 Busy                     */
        uint32_t CHBUSY4: 1;       /*!< bit:     20  Channel 4 Busy                     */
        uint32_t CHBUSY5: 1;       /*!< bit:     21  Channel 5 Busy                     */
        uint32_t CHBUSY6: 1;       /*!< bit:     22  Channel 6 Busy                     */
        uint32_t CHBUSY7: 1;       /*!< bit:     23  Channel 7 Busy                     */
        uint32_t CHBUSY8: 1;       /*!< bit:     24  Channel 8 Busy                     */
        uint32_t CHBUSY9: 1;       /*!< bit:     25  Channel 9 Busy                     */
        uint32_t CHBUSY10: 1;      /*!< bit:     26  Channel 10 Busy                    */
        uint32_t CHBUSY11: 1;      /*!< bit:     27  Channel 11 Busy                    */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t USRRDY: 12;       /*!< bit:  0..11  Channel x User Ready               */
        uint32_t : 4;              /*!< bit: 12..15  Reserved                           */
        uint32_t CHBUSY: 12;       /*!< bit: 16..27  Channel x Busy                     */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} EVSYS_CHSTATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_CHSTATUS_OFFSET       0x0C         /**< \brief (EVSYS_CHSTATUS offset) Channel Status */
#define EVSYS_CHSTATUS_RESETVALUE   0x00000000ul /**< \brief (EVSYS_CHSTATUS reset_value) Channel Status */

#define EVSYS_CHSTATUS_USRRDY0_Pos  0            /**< \brief (EVSYS_CHSTATUS) Channel 0 User Ready */
#define EVSYS_CHSTATUS_USRRDY0      (1 << EVSYS_CHSTATUS_USRRDY0_Pos)
#define EVSYS_CHSTATUS_USRRDY1_Pos  1            /**< \brief (EVSYS_CHSTATUS) Channel 1 User Ready */
#define EVSYS_CHSTATUS_USRRDY1      (1 << EVSYS_CHSTATUS_USRRDY1_Pos)
#define EVSYS_CHSTATUS_USRRDY2_Pos  2            /**< \brief (EVSYS_CHSTATUS) Channel 2 User Ready */
#define EVSYS_CHSTATUS_USRRDY2      (1 << EVSYS_CHSTATUS_USRRDY2_Pos)
#define EVSYS_CHSTATUS_USRRDY3_Pos  3            /**< \brief (EVSYS_CHSTATUS) Channel 3 User Ready */
#define EVSYS_CHSTATUS_USRRDY3      (1 << EVSYS_CHSTATUS_USRRDY3_Pos)
#define EVSYS_CHSTATUS_USRRDY4_Pos  4            /**< \brief (EVSYS_CHSTATUS) Channel 4 User Ready */
#define EVSYS_CHSTATUS_USRRDY4      (1 << EVSYS_CHSTATUS_USRRDY4_Pos)
#define EVSYS_CHSTATUS_USRRDY5_Pos  5            /**< \brief (EVSYS_CHSTATUS) Channel 5 User Ready */
#define EVSYS_CHSTATUS_USRRDY5      (1 << EVSYS_CHSTATUS_USRRDY5_Pos)
#define EVSYS_CHSTATUS_USRRDY6_Pos  6            /**< \brief (EVSYS_CHSTATUS) Channel 6 User Ready */
#define EVSYS_CHSTATUS_USRRDY6      (1 << EVSYS_CHSTATUS_USRRDY6_Pos)
#define EVSYS_CHSTATUS_USRRDY7_Pos  7            /**< \brief (EVSYS_CHSTATUS) Channel 7 User Ready */
#define EVSYS_CHSTATUS_USRRDY7      (1 << EVSYS_CHSTATUS_USRRDY7_Pos)
#define EVSYS_CHSTATUS_USRRDY8_Pos  8            /**< \brief (EVSYS_CHSTATUS) Channel 8 User Ready */
#define EVSYS_CHSTATUS_USRRDY8      (1 << EVSYS_CHSTATUS_USRRDY8_Pos)
#define EVSYS_CHSTATUS_USRRDY9_Pos  9            /**< \brief (EVSYS_CHSTATUS) Channel 9 User Ready */
#define EVSYS_CHSTATUS_USRRDY9      (1 << EVSYS_CHSTATUS_USRRDY9_Pos)
#define EVSYS_CHSTATUS_USRRDY10_Pos 10           /**< \brief (EVSYS_CHSTATUS) Channel 10 User Ready */
#define EVSYS_CHSTATUS_USRRDY10     (1 << EVSYS_CHSTATUS_USRRDY10_Pos)
#define EVSYS_CHSTATUS_USRRDY11_Pos 11           /**< \brief (EVSYS_CHSTATUS) Channel 11 User Ready */
#define EVSYS_CHSTATUS_USRRDY11     (1 << EVSYS_CHSTATUS_USRRDY11_Pos)
#define EVSYS_CHSTATUS_USRRDY_Pos   0            /**< \brief (EVSYS_CHSTATUS) Channel x User Ready */
#define EVSYS_CHSTATUS_USRRDY_Msk   (0xFFFul << EVSYS_CHSTATUS_USRRDY_Pos)
#define EVSYS_CHSTATUS_USRRDY(value) ((EVSYS_CHSTATUS_USRRDY_Msk & ((value) << EVSYS_CHSTATUS_USRRDY_Pos)))
#define EVSYS_CHSTATUS_CHBUSY0_Pos  16           /**< \brief (EVSYS_CHSTATUS) Channel 0 Busy */
#define EVSYS_CHSTATUS_CHBUSY0      (1 << EVSYS_CHSTATUS_CHBUSY0_Pos)
#define EVSYS_CHSTATUS_CHBUSY1_Pos  17           /**< \brief (EVSYS_CHSTATUS) Channel 1 Busy */
#define EVSYS_CHSTATUS_CHBUSY1      (1 << EVSYS_CHSTATUS_CHBUSY1_Pos)
#define EVSYS_CHSTATUS_CHBUSY2_Pos  18           /**< \brief (EVSYS_CHSTATUS) Channel 2 Busy */
#define EVSYS_CHSTATUS_CHBUSY2      (1 << EVSYS_CHSTATUS_CHBUSY2_Pos)
#define EVSYS_CHSTATUS_CHBUSY3_Pos  19           /**< \brief (EVSYS_CHSTATUS) Channel 3 Busy */
#define EVSYS_CHSTATUS_CHBUSY3      (1 << EVSYS_CHSTATUS_CHBUSY3_Pos)
#define EVSYS_CHSTATUS_CHBUSY4_Pos  20           /**< \brief (EVSYS_CHSTATUS) Channel 4 Busy */
#define EVSYS_CHSTATUS_CHBUSY4      (1 << EVSYS_CHSTATUS_CHBUSY4_Pos)
#define EVSYS_CHSTATUS_CHBUSY5_Pos  21           /**< \brief (EVSYS_CHSTATUS) Channel 5 Busy */
#define EVSYS_CHSTATUS_CHBUSY5      (1 << EVSYS_CHSTATUS_CHBUSY5_Pos)
#define EVSYS_CHSTATUS_CHBUSY6_Pos  22           /**< \brief (EVSYS_CHSTATUS) Channel 6 Busy */
#define EVSYS_CHSTATUS_CHBUSY6      (1 << EVSYS_CHSTATUS_CHBUSY6_Pos)
#define EVSYS_CHSTATUS_CHBUSY7_Pos  23           /**< \brief (EVSYS_CHSTATUS) Channel 7 Busy */
#define EVSYS_CHSTATUS_CHBUSY7      (1 << EVSYS_CHSTATUS_CHBUSY7_Pos)
#define EVSYS_CHSTATUS_CHBUSY8_Pos  24           /**< \brief (EVSYS_CHSTATUS) Channel 8 Busy */
#define EVSYS_CHSTATUS_CHBUSY8      (1 << EVSYS_CHSTATUS_CHBUSY8_Pos)
#define EVSYS_CHSTATUS_CHBUSY9_Pos  25           /**< \brief (EVSYS_CHSTATUS) Channel 9 Busy */
#define EVSYS_CHSTATUS_CHBUSY9      (1 << EVSYS_CHSTATUS_CHBUSY9_Pos)
#define EVSYS_CHSTATUS_CHBUSY10_Pos 26           /**< \brief (EVSYS_CHSTATUS) Channel 10 Busy */
#define EVSYS_CHSTATUS_CHBUSY10     (1 << EVSYS_CHSTATUS_CHBUSY10_Pos)
#define EVSYS_CHSTATUS_CHBUSY11_Pos 27           /**< \brief (EVSYS_CHSTATUS) Channel 11 Busy */
#define EVSYS_CHSTATUS_CHBUSY11     (1 << EVSYS_CHSTATUS_CHBUSY11_Pos)
#define EVSYS_CHSTATUS_CHBUSY_Pos   16           /**< \brief (EVSYS_CHSTATUS) Channel x Busy */
#define EVSYS_CHSTATUS_CHBUSY_Msk   (0xFFFul << EVSYS_CHSTATUS_CHBUSY_Pos)
#define EVSYS_CHSTATUS_CHBUSY(value) ((EVSYS_CHSTATUS_CHBUSY_Msk & ((value) << EVSYS_CHSTATUS_CHBUSY_Pos)))
#define EVSYS_CHSTATUS_MASK         0x0FFF0FFFul /**< \brief (EVSYS_CHSTATUS) MASK Register */

/* -------- EVSYS_INTENCLR : (EVSYS Offset: 0x10) (R/W 32) Interrupt Enable Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t OVR0: 1;          /*!< bit:      0  Channel 0 Overrun Interrupt Enable */
        uint32_t OVR1: 1;          /*!< bit:      1  Channel 1 Overrun Interrupt Enable */
        uint32_t OVR2: 1;          /*!< bit:      2  Channel 2 Overrun Interrupt Enable */
        uint32_t OVR3: 1;          /*!< bit:      3  Channel 3 Overrun Interrupt Enable */
        uint32_t OVR4: 1;          /*!< bit:      4  Channel 4 Overrun Interrupt Enable */
        uint32_t OVR5: 1;          /*!< bit:      5  Channel 5 Overrun Interrupt Enable */
        uint32_t OVR6: 1;          /*!< bit:      6  Channel 6 Overrun Interrupt Enable */
        uint32_t OVR7: 1;          /*!< bit:      7  Channel 7 Overrun Interrupt Enable */
        uint32_t OVR8: 1;          /*!< bit:      8  Channel 8 Overrun Interrupt Enable */
        uint32_t OVR9: 1;          /*!< bit:      9  Channel 9 Overrun Interrupt Enable */
        uint32_t OVR10: 1;         /*!< bit:     10  Channel 10 Overrun Interrupt Enable */
        uint32_t OVR11: 1;         /*!< bit:     11  Channel 11 Overrun Interrupt Enable */
        uint32_t : 4;              /*!< bit: 12..15  Reserved                           */
        uint32_t EVD0: 1;          /*!< bit:     16  Channel 0 Event Detection Interrupt Enable */
        uint32_t EVD1: 1;          /*!< bit:     17  Channel 1 Event Detection Interrupt Enable */
        uint32_t EVD2: 1;          /*!< bit:     18  Channel 2 Event Detection Interrupt Enable */
        uint32_t EVD3: 1;          /*!< bit:     19  Channel 3 Event Detection Interrupt Enable */
        uint32_t EVD4: 1;          /*!< bit:     20  Channel 4 Event Detection Interrupt Enable */
        uint32_t EVD5: 1;          /*!< bit:     21  Channel 5 Event Detection Interrupt Enable */
        uint32_t EVD6: 1;          /*!< bit:     22  Channel 6 Event Detection Interrupt Enable */
        uint32_t EVD7: 1;          /*!< bit:     23  Channel 7 Event Detection Interrupt Enable */
        uint32_t EVD8: 1;          /*!< bit:     24  Channel 8 Event Detection Interrupt Enable */
        uint32_t EVD9: 1;          /*!< bit:     25  Channel 9 Event Detection Interrupt Enable */
        uint32_t EVD10: 1;         /*!< bit:     26  Channel 10 Event Detection Interrupt Enable */
        uint32_t EVD11: 1;         /*!< bit:     27  Channel 11 Event Detection Interrupt Enable */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t OVR: 12;          /*!< bit:  0..11  Channel x Overrun Interrupt Enable */
        uint32_t : 4;              /*!< bit: 12..15  Reserved                           */
        uint32_t EVD: 12;          /*!< bit: 16..27  Channel x Event Detection Interrupt Enable */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} EVSYS_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_INTENCLR_OFFSET       0x10         /**< \brief (EVSYS_INTENCLR offset) Interrupt Enable Clear */
#define EVSYS_INTENCLR_RESETVALUE   0x00000000ul /**< \brief (EVSYS_INTENCLR reset_value) Interrupt Enable Clear */

